{
  "body":
  "Despite four decades of performing and hearing Queen's \"Bohemian Rhapsody,\" guitarist Brian May still enjoys what is undoubtedly his biggest hit.↵↵“I’m not sick of it,” he told the BBC late last year. “You can’t complain that people want to talk about it all these years later. I still enjoy hearing it. If it comes on the radio, I’ll turn it up and listen. “But no air guitar,” he says. “I’m too old for air guitar now.”↵↵One of the best-known tributes to “Bohemian Rhapsody” appeared in Mike Myers’ 1992 film, Wayne’s World. In the scene, shown below, Wayne and his friends sing along and headbang to the song while driving at night. According to May, that was a case of art imitating life.↵↵“I didn’t know Mike Myers,” he says, “but he rang me up out of the blue and said, ‘We’ve done this amazing sequence in our new film—can we have your approval?’ ”↵↵At Myers’ request, May took the segment to singer Freddie Mercury, who was then near the end of his life. (Mercury died of pneumonia resulting from AIDS in 1991.)↵↵“I took it around to Freddie, who was not in a good state at that time,” May says. “He was..confined to his bed, but I took it round and played it to him and he loved it.↵↵“Strangely enough, the humor in it was quite close to our own. Because we did that kind of thing in the car, bouncing up and down to our own tracks!”↵↵The song’s appearance in the movie revived it and sent it on a second run into the music charts and helped Queen launch a comeback in the U.S. in the years following Mercury’s death.↵↵“There’s a huge irony there,” May says, “because there was a time when we completely owned America and we would tour there every year. It seemed like we couldn’t go wrong. And then we lost America for various reasons, which are now history.↵↵“Freddie had a very dark sense of humor. And he used to say, ‘I suppose I’ll have to die before we get America back.’ And, in a sense, that was what happened. And it was Wayne’s World—which came completely out of nowhere—that made it happen.",
  "description":
  "Despite four decades of performing and hearing Queen's \"Bohemian Rhapsody,\" guitarist Brian May still enjoys what is undoubtedly his biggest hit.  “I’m not sick of it,” he told the BBC late last year. “You can’t complain that people want to talk about it all these years later. I still enjoy hearing it. If it comes on the radio, I’ll turn it up and listen. “But no air guitar,” he says. “I’m too old for air guitar now.”",
  "image":
  "http://www.guitarworld.com/sites/default/files/public/featured-image/Getty621Images-86121762.jpg",
  "keywords": [
    "mercury", "mike", "america", "hit", "world", "humor", "ill", "sense", "scene", "took", "brian", "bohemian", "waynes",
    "close", "rhapsody", "myers"
  ],
  "published": "2016-07-18T15:52:33.000Z",
  "title": "Brian May: ‘Wayne’s World’ “Bohemian Rhapsody” Scene Hit Close to Home",
  "url": "http://www.guitarworld.com/brian-may-wayne-s-world-bohemian-rhapsody-scene-hit-close-home/25749",
  "videos": ["https://www.youtube.com/embed/thyJOnasHVE"]
}
